import React, { useState } from "react";
import { Container, Card } from "react-bootstrap";
import Foot from "../components/Foot";
const Agreement = () => {
  const [agree, setAgree] = useState(false);
  const checkboxHandler = () => {
    setAgree(!agree);
  };
  const btnHandler = () => {
    window.location = "/Login";
  };
  return (
    <>
      <Container>
        <br />
        <div className="box">
          <Card>
            <Card.Title>
              <div className="agreement-color">
                <br />
                <h3 className="text-center">Agreement</h3>
                <br />
              </div>
              <div className="agreement-text w100"></div>
            </Card.Title>
            <Card.Body>
              <p>
                Suandok Hospital นี้ ทำขึ้นระหว่างโรงพยาบาลมหาราชนครเชียงใหม่
                ซึ่งต่อไปนี้เรียกว่า "ผู้ให้บริการ" ฝ่ายหนึ่ง กับ ผู้ใช้บริการ
                ซึ่งต่อไปนี้เรียกว่า "ผู้ใช้บริการ" อีกฝ่ายหนึ่ง
                โดยบริการแอพพลิเคชั่น Suandok Hospital นี้
                จะให้บริการหรือให้ความสะดวกแก่ผู้ใช้บริการ เช่น
                การกำหนดนัดพบแพทย์ การเรียกดูประวัติการรักษาของผู้ใช้บริการ
                เป็นต้น เมื่อผู้ใช้บริการได้เข้าใช้บริการแอพพลิเคชั่น Suandok
                Hospital
                ผู้ใช้บริการตกลงที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขการใช้บริการนี้
                ดังต่อไปนี้ 1. คำจำกัดความ 1.1 “บริการนี้” หมายถึง บริการ
                Suandok Hospital 1.2 “ผู้ใช้บริการ” หมายถึง
                ผู้ทำคำขอใช้บริการนี้
                ไม่ว่าจะเป็นการสมัครด้วยวิธีใดก็ตามที่ผู้ให้บริการกำหนด 1.3
                “รหัสประจำตัว” หมายความถึง Login Name หรือ Username, รหัสผ่าน
                (Password), PIN –Person Identification Number, รหัส OTP – One
                Time Password
                รวมถึงรหัสอื่นใดที่เกี่ยวข้องกับการเข้าใช้บริการนี้
                ไม่ว่าจะเรียกด้วยชื่อใดๆ
                และไม่ว่าจะเป็นรหัสที่ผู้ให้บริการเป็นผู้กำหนดให้หรือเป็นรหัสที่ผู้ใช้บริการเป็นผู้กำหนดเองก็ตาม
                2. บริการ ผู้ใช้บริการสามารถใช้บริการนี้ เพื่อดำเนินการต่างๆ
                ดังต่อไปนี้ 2.1 ข้อมูลเบื้องต้น ประกอบด้วย เวลาทำการ
                วันหยุดโรงพยาบาล คลินิกเฉพาะทาง รายชื่อแพทย์ แผนก-เบอร์ติดต่อ
                และความรู้ผู้ป่วย 2.2 ตรวจรักษา ประกอบด้วย การลงทะเบียนตรวจ
                ใบนัด สถานะการรับยา คิวตรวจ และ อื่นๆ 2.3 การบริจาคต่างๆ 2.4
                สิทธิพิเศษ สำหรับผู้มีอุปการคุณ สำหรับผู้บริจาคโลหิต
                และสิทธิพิเศษอื่นๆ 2.5 ช่วยเหลือ ได้แก่
                การติดต่อกรณีเจ็บป่วยฉุกเฉิน ติดต่อสอบถาม แผนที่โรงพยาบาล
                แบบประเมินความพึงพอใจ และคู่มือการใช้งาน เป็นต้น 2.6
                จัดการข้อมูล ได้แก่ ข้อมูลส่วนตัวของผู้ใช้บริการ ข้อมูลบุคลากร
                เป็นต้น 3. การใช้บริการ ผู้ใช้บริการรับทราบ
                ยอมรับและตกลงกับผู้ให้บริการ ดังนี้ 3.1 ผู้ขอใช้บริการ
                ต้องเป็นเจ้าของบัญชี LINE และเป็นเพื่อนกับบัญชี Suandok Hospital
                ได้แล้วเท่านั้น 3.2 การใช้บริการ “ตรวจรักษา” และ “จัดการข้อมูล”
                บน Suandok Hospital ครั้งแรก
                ต้องยืนยันตัวตนโดยบันทึกข้อมูลตามหน้าจอลงทะเบียน 3.3
                การใช้บริการใดๆ ที่ทำโดยใช้รหัสประจำตัวผู้ใช้บริการ
                ให้ถือว่าเป็นการกระทำของผู้ใช้บริการเอง
                ซึ่งตกลงและยอมรับว่าการกระทำใดๆ
                ตามข้อกำหนดและเงื่อนไขการใช้บริการนี้ ถือว่าถูกต้องสมบูรณ์
                และผูกพันผู้ขอใช้บริการทุกประการ
                โดยไม่ต้องลงลายมือชื่อในเอกสารใดๆ
                และผู้ขอใช้บริการตกลงรับผิดชอบการกระทำดังกล่าวเสมือนว่าเป็นผู้กระทำด้วยตนเอง
                3.4 ผู้ใช้บริการจะรักษารหัสประจำตัวผู้ใช้บริการไว้เป็นความลับ
                และจะไม่เปิดเผยหรือกระทำการใดๆ ที่อาจทำให้
                ผู้อื่นทราบรหัสประจำตัวดังกล่าว
                หากมีบุคคลอื่นล่วงรู้รหัสประจำตัวของผู้ใช้บริการ
                ผู้ใช้บริการต้องแจ้งให้ผู้ให้ บริการทราบ
                เพื่อดำเนินการแก้ไขตามวิธีที่ผู้ให้บริการกำหนด 3.5
                ผู้ใช้บริการสามารถเปลี่ยนแปลง Login Name หรือ Username และ/หรือ
                รหัสผ่าน (Password) และ/หรือ PIN -Person Identification Number
                และ/หรือ รหัสที่เกี่ยวข้องกับการเข้าใช้บริการนี้
                เมื่อใดก็ได้โดยดำเนินการตามวิธีการและเงื่อนไขที่ผู้ให้บริการกำหนด
                3.6
                ผู้ใช้บริการสามารถโอนเงินหรือชำระค่ารักษาพยาบาลและค่ายาผ่านบริการนี้
                โดยผู้ใช้บริการจะต้องระบุบัญชีของผู้ขอใช้บริการ
                และระบุบัญชีของผู้รับโอน ทั้งนี้ ผู้ใช้บริการจะเป็นผู้ทำรายการ
                และตรวจสอบความถูกต้องของเลขที่บัญชีของผู้ใช้บริการและผู้รับโอนด้วยตนเอง
                โดยผู้ให้บริการจะดำเนินการตามคำสั่งของผู้ใช้บริการ 3.7
                ผู้ใช้บริการรับทราบว่าคำศัพท์ทางเทคนิคทางการแพทย์ที่เกี่ยวกับการวินิจฉัยโรคนั้น
                เป็นคำศัพท์ภาษาอังกฤษและยากต่อการทำความเข้าใจของผู้ใช้บริการ
                ผู้ให้บริการจึงทำการแปลคำศัพท์ทางเทคนิคทางการแพทย์ดังกล่าวเป็นภาษาไทยและเป็นคำที่ผู้ใช้บริการสามารถเข้าใจการวินิจฉัยโรคของแพทย์ได้ง่ายขึ้นเท่านั้น
                ซึ่งความหมายอาจไม่ตรงตามตัวอักษรของคำศัพท์ทางเทคนิคทางการแพทย์
                หากผู้ใช้บริการมีข้อสงสัยเกี่ยวกับข้อมูลประวัติการรักษา
                โปรดติดต่อสอบถามผู้ให้บริการ 3.8
                หากมีความผิดพลาดเกิดขึ้นในการใช้บริการนี้
                หรือมีข้อสงสัยเกี่ยวกับข้อมูลของผู้ใช้บริการ หรือข้อมูลประวัติ
                การรักษาของผู้ใช้บริการ ผู้ใช้บริการจะต้องแจ้งรายละเอียดต่างๆ
                ที่เกี่ยวข้องให้แก่ผู้ให้บริการ เพื่อให้ผู้
                ให้บริการใช้เป็นข้อมูลในการตรวจสอบข้อผิดพลาด 3.9 ผู้ขอใช้บริการ
                ยินยอมให้โรงพยาบาลส่งข้อมูลส่วนบุคคลที่เกี่ยวข้องกับการใช้บริการ
                เช่น ชื่อผู้ขอใช้บริการ การลงทะเบียน การนัดตรวจรักษา
                หรือข้อมูลอื่น ผ่านระบบแจ้งเตือน เช่น e-Mail เป็นต้น 4.
                ความรับผิดและข้อยกเว้นความรับผิดของผู้ให้บริการ
                ผู้ให้บริการจะรับผิดชอบสำหรับความเสียหายที่เกิดขึ้นในกรณีที่ผู้ให้บริการกระทำโดยจงใจ
                หรือประมาทเลินเล่อ อย่างร้ายแรง
                ซึ่งเป็นความเสียหายที่ตามปกติย่อมเกิดขึ้นเท่านั้น
                แต่ผู้ให้บริการไม่ต้องรับผิดในความเสียหายที่เกิดขึ้นจากพฤติการณ์พิเศษ
                ทั้งนี้ ผู้ใช้บริการตกลงว่า ไม่ว่าในกรณีใดๆ
                ผู้ให้บริการไม่ต้องรับผิดชอบในความเสียหายที่เกิดขึ้นจากสาเหตุต่างๆ
                ดังต่อไปนี้ 4.1
                มีการใช้รหัสประจำตัวผู้ใช้บริการควบคู่กับรหัสลับแรกเข้าหรือรหัสลับส่วนตัว
                หรือมีการใช้ Mobile PIN หรือวิธีการอื่นใดตามที่ผู้ให้บริการกำหนด
                ไม่ว่าจะเป็นการกระทำของผู้ใดก็ตาม 4.2 เหตุสุดวิสัยต่างๆ
                หรือเหตุการณ์ที่ผู้ให้บริการไม่สามารถควบคุมได้
                ซึ่งรวมถึงการที่อุปกรณ์ ระบบสื่อสาร
                หรือการส่งสัญญาณเชื่อมต่อไม่ทำงาน
                หรือการรบกวนจากไวรัสคอมพิวเตอร์
                หรือจากการกระทำที่ไม่ชอบด้วยกฎหมาย
                หรือในกรณีที่ผู้ให้บริการปิดให้บริการนี้
                เพื่อปรับปรุงหรือบำรุงรักษาระบบ
                อันเป็นเหตุให้ผู้ใช้บริการไม่สามารถใช้บริการนี้ได้ 4.3
                ความล่าช้า ความผิดพลาด หรือความบกพร่องของระบบคอมพิวเตอร์
                หรืออุปกรณ์ต่างๆ ของผู้ใช้บริการ ของ ผู้ให้บริการ
                หรือของผู้ให้บริการระบบอินเทอร์เน็ต (Internet Service Provider)
                หรือเครือข่ายการสื่อสารอื่น เว้นแต่ในกรณีที่ความล่าช้า
                ความผิดพลาด หรือความบกพร่องดังกล่าว
                เกิดจากความจงใจหรือประมาทเลินเล่อ อย่างร้ายแรงของผู้ให้บริการ
                4.4 ความล่าช้าในขั้นตอนการดำเนินการของบริการนี้ 4.5
                การที่ผู้ใช้บริการไม่ปฏิบัติตามข้อกำหนดและเงื่อนไขของบริการนี้
                5. ข้อมูลการติดต่อ และการส่งคำบอกกล่าว 5.1
                ผู้ใช้บริการตกลงให้ผู้ให้บริการติดต่อสอบถาม เก็บ รวบรวม หรือ
                ใช้ข้อมูลบางประการหรือทั้งหมดเกี่ยวกับ ผู้ใช้บริการได้
                ตามความจำเป็นและเหมาะสม 5.2
                ผู้ใช้บริการตกลงและยินยอมให้ผู้ให้บริการส่งข้อมูลบริการ
                หรือรายการส่งเสริมการรักษาพยาบาลต่างๆ ไปยัง
                ไปรษณีย์อิเล็กทรอนิกส์ (E-mail)
                และหมายเลขโทรศัพท์มือถือของผู้ใช้บริการ 5.3 หนังสือ จดหมาย
                คำบอกกล่าวใดๆ
                ของผู้ให้บริการที่จัดส่งให้แก่ผู้ใช้บริการทางไปรษณีย์
                หรือไปรษณีย์ อิเล็กทรอนิกส์ (E-mail)
                ตามที่อยู่ซึ่งผู้ใช้บริการได้แจ้งให้ผู้ให้บริการทราบ ให้ถือว่า
                เป็นการจัดส่งให้แก่ผู้ขอใช้บริการโดยชอบแล้ว
                และในกรณีที่ผู้ใช้บริการเปลี่ยนแปลงที่อยู่ดังกล่าว
                ผู้ใช้บริการจะแจ้งให้ผู้ให้บริการทราบเป็นลายลักษณ์อักษร 6.
                การแก้ไขเพิ่มเติม หรือยกเลิกการให้บริการ บริการนี้
                เป็นการให้บริการตามสภาพที่เป็นอยู่ (AS IS) และมีอยู่ (AS
                AVAILABLE) ผู้ให้บริการสงวนสิทธิ์ที่จะ เปลี่ยนแปลง จำกัด
                หรือระงับการเข้าถึง หรือยกเลิกการให้บริการนี้ในเวลาใดๆ ก็ได้
                โดยไม่ต้องแจ้งให้ ผู้ใช้บริการทราบล่วงหน้า
                ให้บริการอาจแก้ไขเพิ่มเติมข้อกำหนดและเงื่อนไขการใช้บริการนี้ในเวลาใดๆ
                ก็ได้ และในการที่ผู้ใช้บริการยังคงใช้บริการนี้ต่อไป
                ให้ถือว่าท่านรับทราบและตกลงผูกพันตามการแก้ไข
                โดยผู้ใช้บริการมีหน้าที่ติดตามการแก้ไขเปลี่ยนแปลงดังกล่าว
                และจะไม่อ้างเหตุในการไม่ทราบถึงการแก้ไขเพิ่มเติมข้อกำหนดและเงื่อนการใช้บริการมา
                เป็นเหตุในการฝ่าฝืนข้อกำหนดและเงื่อนไขนี้ได้ 7.
                กฎหมายที่ใช้บังคับ
                หากมีข้อพิพาทใดเกิดขึ้นจากการให้บริการของผู้ให้บริการอันเนื่องมาจากบริการนี้
                ผู้ใช้บริการและผู้ให้บริการตกลงใช้กฎหมายไทยในการระงับข้อพิพาท
              </p>
            </Card.Body>
          </Card>
          <div className="d-flex flex-column align-items-center">
            <div className="form-check">
              <input
                type="checkbox"
                id="agree"
                className="form-check-input"
                onChange={checkboxHandler}
              />
              <label htmlFor="agree" className="form-check-label">
                I agree to <b>terms and conditions</b>
              </label>
            </div>
            <button
              disabled={!agree}
              className={`btn btn-primary ${!agree ? "disabled" : ""}`}
              onClick={btnHandler}
            >
              Continue
            </button>
          </div>
        </div>
        <br />
        <br />
        <br />
        <br />
        <br />
      </Container>
      <Foot />
    </>
  );
};

export default Agreement;
